class BasePageLocators:

    BASE_URL = "https://qa-scooter.praktikum-services.ru/"
    DZEN_URL = "https://dzen.ru/?yredirect=true"

class FaqAnswers:
    HOW_MUCH_ANSWER = "Сутки — 400 рублей. Оплата курьеру — наличными или картой."
    WANT_FEW_SCOOTERS_ANSWER = "Пока что у нас так: один заказ — один самокат. Если хотите покататься с друзьями, можете просто сделать несколько"
    CALCULATING_RENTTIME_ANSWER = "Допустим, вы оформляете заказ на 8 мая. Мы привозим самокат 8 мая в течение дня. Отсчёт времени аренды начинается с момента, когда вы оплатите заказ курьеру. Если мы привезли самокат 8 мая в 20:30, суточная аренда закончится 9 мая в 20:30."
    ORDER_FOR_TODAY_ANSWER = "Только начиная с завтрашнего дня. Но скоро станем расторопнее."
    RETURN_SCOOTER_EARLY_ANSWER = "Пока что нет! Но если что-то срочное — всегда можно позвонить в поддержку по красивому номеру 1010."
    CHARGER_FOR_SCOOTER_ANSWER = "Самокат приезжает к вам с полной зарядкой. Этого хватает на восемь суток — даже если будете кататься без передышек и во сне. Зарядка не понадобится."
    CANCEL_ORDER_ANSWER = "Да, пока самокат не привезли. Штрафа не будет, объяснительной записки тоже не попросим. Все же свои."
    OUT_OF_MOSCOW_ANSWER = "Да, обязательно. Всем самокатов! И Москве, и Московской области."
    OUTSIDE_MKAD_DELIVERY_ANSWER = "Да, обязательно. Всем самокатов! И Москве, и Московской области."
    